In [197]:
# Add dependencies
import pandas as pd

In [198]:
# Files to load in to Analysis
schools_to_load_data = "Resources/schools_complete.csv"
students_to_load_data = "Resources/students_complete.csv"

In [199]:
# Read the files into a Dataframe
schools_df = pd.read_csv(schools_to_load_data)
students_df = pd.read_csv(students_to_load_data)

In [200]:
# Count the number of values in each column to determine missing rows
schools_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [201]:
# Use ISNULL to see if any values in each column are NULL
schools_df.isnull().sum()

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [202]:
# Use NOTNULL to see if any values in each column are NULL (opposite of the above cell)
schools_df.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [203]:
# Count the number of values in each column to determine missing rows
students_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [204]:
# Use ISNULL to see if any values in each column are NULL
students_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [205]:
# Use NOTNULL to see if any values in each column are NULL (opposite of the above cell)
students_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [206]:
# Determine data types for the school DataFrame
schools_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [207]:
schools_df["school_name"].dtype

dtype('O')

In [208]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [209]:
# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    students_df["student_name"] = students_df["student_name"].str.replace(word,"")

<ipython-input-209-95febb0a8019>:3: FutureWarning: The default value of regex will change from True to False in a future version.
  students_df["student_name"] = students_df["student_name"].str.replace(word,"")

In [210]:
# Combine the data into a single dataset
school_data_complete_df = pd.merge(students_df, schools_df, on=["school_name","school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [211]:
# Calculate the number of unique Students
student_count = school_data_complete_df['Student ID'].count()
student_count

39170

In [212]:
# Calculate the number of unique Schools
school_count = len(school_data_complete_df['School ID'].unique())
school_count

15

In [213]:
# Calculate the sum of Budget for each School
school_budget = schools_df['budget'].sum()
school_budget

24649428

In [214]:
# Average Reading Score
mean_reading = school_data_complete_df['reading_score'].mean()
mean_reading

81.87784018381414

In [215]:
# Average Math Score
mean_math = school_data_complete_df['math_score'].mean()
mean_math

78.98537145774827

In [216]:
# Set a new variable of a series of booleans to compare the math and reading scores v the passing grade
passing_math_dep = school_data_complete_df['math_score'] >= 70
passing_reading_dep = school_data_complete_df['reading_score'] >= 70

In [217]:
# Get only the students that passed math and reading
passing_math = school_data_complete_df[school_data_complete_df['math_score'] >= 70]
passing_reading = school_data_complete_df[school_data_complete_df['reading_score'] >= 70]

In [218]:
# Get the number of students who passed both subjects and put them in different variables
passing_math_count = passing_math["student_name"].count()
passing_reading_count = passing_reading["student_name"].count()

In [219]:
# Get the % of those who passed each subject
passing_math_percentage = (passing_math_count / student_count) * 100
passing_reading_percentage = (passing_reading_count / student_count) * 100

In [220]:
# Get a new DataFrame of those who passed reading and math and assign the number of students to new variable
passing_both = school_data_complete_df[(school_data_complete_df['math_score'] >= 70) & (school_data_complete_df['reading_score'] >= 70)]
passing_both_count = passing_both['Student ID'].count()

In [221]:
# Get the percentage of those that passed both reading and math
overall_pass_both_percentage = (passing_both_count / student_count) * 100
overall_pass_both_percentage

65.17232575950983

In [222]:
# Assign the summary statistics to a new DataFrame
district_summary_df = pd.DataFrame(
    [{'Total Schools': school_count,
      'Total Students': student_count,
      'Total Budget': school_budget,
      'Average Reading Score': mean_reading,
      'Average Math Score': mean_math,
      '% Passing Reading': passing_reading_percentage,
      '% Passing Math': passing_math_percentage,
      '% Overall Passing': overall_pass_both_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,39170,24649428,81.87784,78.985371,85.805463,74.980853,65.172326

In [223]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [224]:
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [225]:
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)
district_summary_df["Average Reading Score"]

0    81.9
Name: Average Reading Score, dtype: object

In [226]:
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)
district_summary_df["Average Math Score"]

0    79.0
Name: Average Math Score, dtype: object

In [227]:
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [228]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,79.0,86,75,65

In [229]:
schools_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [230]:
# Determine the School Type
per_school_types = schools_df.set_index(["school_name"])["type"]
per_school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [231]:
per_school_size = schools_df['size']
per_school_size

0     2917
1     2949
2     1761
3     4635
4     1468
5     2283
6     1858
7     4976
8      427
9      962
10    1800
11    3999
12    4761
13    2739
14    1635
Name: size, dtype: int64

In [232]:
schools_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [233]:
per_schools_count = schools_df.set_index(['school_name'])['size']
per_schools_count

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [234]:
per_schools_count_df = pd.DataFrame(per_schools_count)
per_schools_count_df

                       size
school_name
Huang High School      2917
Figueroa High School   2949
Shelton High School    1761
Hernandez High School  4635
Griffin High School    1468
Wilson High School     2283
Cabrera High School    1858
Bailey High School     4976
Holden High School      427
Pena High School        962
Wright High School     1800
Rodriguez High School  3999
Johnson High School    4761
Ford High School       2739
Thomas High School     1635

In [235]:
# Calculate the total student count.
per_school_counts = school_data_complete_df["school_name"].value_counts()
per_school_counts

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [236]:
per_school_budget = schools_df.set_index(['school_name'])['budget']
per_school_budget

school_name
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [237]:
per_school_capita = per_school_budget / per_school_counts
per_school_capita

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [238]:
math_score_per_school = school_data_complete_df.groupby(['school_name']).mean()['math_score']

In [239]:
reading_score_per_school = school_data_complete_df.groupby(['school_name']).mean()['reading_score']

In [240]:
per_school_passing_math = school_data_complete_df[school_data_complete_df['math_score'] >= 70]
per_school_passing_reading = school_data_complete_df[school_data_complete_df['reading_score'] >= 70]

In [241]:
per_school_passing_math = per_school_passing_math.groupby(['school_name']).count()['math_score']
per_school_passing_reading = per_school_passing_reading.groupby(['school_name']).count()['reading_score']

In [242]:
per_school_passing_math = per_school_passing_math / per_school_counts * 100
per_school_passing_reading = per_school_passing_reading / per_school_counts * 100

In [243]:
school_data_complete_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [244]:
# Calculate the students who passed both math and reading.
per_passing_math_reading = school_data_complete_df[(school_data_complete_df['reading_score'] >= 70) & (school_data_complete_df['math_score'] >= 70)]
per_passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [245]:
# Calculate the number of students who passed both math and reading.
per_passing_math_reading = per_passing_math_reading.groupby(["school_name"]).count()["Student ID"]
per_passing_math_reading.head()

school_name
Bailey High School      2719
Cabrera High School     1697
Figueroa High School    1569
Ford High School        1487
Griffin High School     1330
Name: Student ID, dtype: int64

In [246]:
# Calculate Overall % Passing by School
per_overall_passing_percentage = per_passing_math_reading / per_school_counts * 100
per_overall_passing_percentage

Bailey High School       54.642283
Cabrera High School      91.334769
Figueroa High School     53.204476
Ford High School         54.289887
Griffin High School      90.599455
Hernandez High School    53.527508
Holden High School       89.227166
Huang High School        53.513884
Johnson High School      53.539172
Pena High School         90.540541
Rodriguez High School    52.988247
Shelton High School      89.892107
Thomas High School       90.948012
Wilson High School       90.582567
Wright High School       90.333333
dtype: float64

In [290]:
# Creating new summary data frame based on the calculations

per_school_summary_df = pd.DataFrame({
    "School Type": per_school_types,
    "Total Students": per_school_counts,
    "Total School Budget": per_school_budget,
    "Per Student Budget": per_school_capita,
    "Average Math Score": math_score_per_school,
    "Average Reading Score": reading_score_per_school,
    "% Passing Math": per_school_passing_math,
    "% Passing Reading": per_school_passing_reading,
    "% Overall Passing": per_overall_passing_percentage
})
per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [291]:
per_school_summary_df['Total School Budget'] = per_school_summary_df['Total School Budget'].astype(float)
per_school_summary_df['Per Student Budget'] = per_school_summary_df['Per Student Budget'].astype(float)
per_school_summary_df.dtypes

School Type               object
Total Students             int64
Total School Budget      float64
Per Student Budget       float64
Average Math Score       float64
Average Reading Score    float64
% Passing Math           float64
% Passing Reading        float64
% Overall Passing        float64
dtype: object

In [292]:
per_school_summary['Total School Budget'] = per_school_summary['Total School Budget'].map("${:,.2f}".format)

ValueError: Unknown format code 'f' for object of type 'str'

In [293]:
per_school_summary['Total School Budget']

Cabrera High School      $1,081,356.00
Thomas High School       $1,043,130.00
Griffin High School        $917,500.00
Wilson High School       $1,319,574.00
Pena High School           $585,858.00
Wright High School       $1,049,400.00
Shelton High School      $1,056,600.00
Holden High School         $248,087.00
Bailey High School       $3,124,928.00
Ford High School         $1,763,916.00
Johnson High School      $3,094,650.00
Hernandez High School    $3,022,020.00
Huang High School        $1,910,635.00
Figueroa High School     $1,884,411.00
Rodriguez High School    $2,547,363.00
Name: Total School Budget, dtype: object

In [294]:
per_school_summary['Per Student Budget'] = per_school_summary['Per Student Budget'].map("${:,.2f}".format)

ValueError: Unknown format code 'f' for object of type 'str'

In [295]:
per_school_summary['Per Student Budget']

Cabrera High School      $582.00
Thomas High School       $638.00
Griffin High School      $625.00
Wilson High School       $578.00
Pena High School         $609.00
Wright High School       $583.00
Shelton High School      $600.00
Holden High School       $581.00
Bailey High School       $628.00
Ford High School         $644.00
Johnson High School      $650.00
Hernandez High School    $652.00
Huang High School        $655.00
Figueroa High School     $639.00
Rodriguez High School    $637.00
Name: Per Student Budget, dtype: object

In [265]:
# Sort the Overall Passing Percentage column to find top schools
per_school_summary = per_school_summary.sort_values(['% Overall Passing'], ascending=False)
per_school_summary.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541

In [266]:
# Sort the Overall Passing Percentage column to find bottom schools
bottom_school_summary = per_school_summary.sort_values(['% Overall Passing'], ascending=True)
bottom_school_summary.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172

In [270]:
# Get all Grades and put them in individual dataframe
ninth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "9th")]
tenth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "10th")]
eleventh_graders = school_data_complete_df[(school_data_complete_df["grade"] == "11th")]
twelfth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "12th")]

ninth_graders.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
12,12,Brittney Walker,F,9th,Huang High School,64,79,0,District,2917,1910635
13,13,William Long,M,9th,Huang High School,71,79,0,District,2917,1910635

In [277]:
# Grouping each grade dataframe by school and getting average math scores
ninth_graders_math_scores = ninth_graders.groupby(['school_name']).mean()['math_score']
tenth_graders_math_scores = tenth_graders.groupby(['school_name']).mean()['math_score']
eleventh_graders_math_scores = eleventh_graders.groupby(['school_name']).mean()['math_score']
twelfth_graders_math_scores = twelfth_graders.groupby(['school_name']).mean()['math_score']

In [279]:
# Grouping each grade dataframe by school and getting average reading scores
ninth_graders_reading_scores = ninth_graders.groupby(['school_name']).mean()['reading_score']
tenth_graders_reading_scores = tenth_graders.groupby(['school_name']).mean()['reading_score']
eleventh_graders_reading_scores = eleventh_graders.groupby(['school_name']).mean()['reading_score']
twelfth_graders_reading_scores = twelfth_graders.groupby(['school_name']).mean()['reading_score']

In [280]:
# Add the math scores by grade to a dataframe
math_scores_by_grade = pd.DataFrame({
    "Ninth Grade": ninth_graders_math_scores,
    "Tenth Grade": tenth_graders_math_scores,
    "Eleventh Grade": eleventh_graders_math_scores,
    "Twelfth Grade": twelfth_graders_math_scores,
})

math_scores_by_grade.head()

                      Ninth Grade  Tenth Grade  Eleventh Grade  Twelfth Grade
school_name
Bailey High School      77.083676    76.996772       77.515588      76.492218
Cabrera High School     83.094697    83.154506       82.765560      83.277487
Figueroa High School    76.403037    76.539974       76.884344      77.151369
Ford High School        77.361345    77.672316       76.918058      76.179963
Griffin High School     82.044010    84.229064       83.842105      83.356164

In [300]:
# Add the reading scores by grade to a dataframe
reading_scores_by_grade = pd.DataFrame({
    "Ninth Grade": ninth_graders_reading_scores,
    "Tenth Grade": tenth_graders_reading_scores,
    "Eleventh Grade": eleventh_graders_reading_scores,
    "Twelfth Grade": twelfth_graders_reading_scores,
})

reading_scores_by_grade.head()

                      Ninth Grade  Tenth Grade  Eleventh Grade  Twelfth Grade
school_name
Bailey High School      81.303155    80.907183       80.945643      80.912451
Cabrera High School     83.676136    84.253219       83.788382      84.287958
Figueroa High School    81.198598    81.408912       80.640339      81.384863
Ford High School        80.632653    81.262712       80.403642      80.662338
Griffin High School     83.369193    83.706897       84.288089      84.013699

In [301]:
# Change the format of each column
reading_scores_by_grade["Ninth Grade"] = reading_scores_by_grade["Ninth Grade"].map("{:.1f}%".format)
reading_scores_by_grade["Tenth Grade"] = reading_scores_by_grade["Tenth Grade"].map("{:.1f}%".format)
reading_scores_by_grade["Eleventh Grade"] = reading_scores_by_grade["Eleventh Grade"].map("{:.1f}%".format)
reading_scores_by_grade["Twelfth Grade"] = reading_scores_by_grade["Twelfth Grade"].map("{:.1f}%".format)

In [302]:
# Remove the Index Name
reading_scores_by_grade.index.name = None

#Display the frame
reading_scores_by_grade.head()

                     Ninth Grade Tenth Grade Eleventh Grade Twelfth Grade
Bailey High School         81.3%       80.9%          80.9%         80.9%
Cabrera High School        83.7%       84.3%          83.8%         84.3%
Figueroa High School       81.2%       81.4%          80.6%         81.4%
Ford High School           80.6%       81.3%          80.4%         80.7%
Griffin High School        83.4%       83.7%          84.3%         84.0%

In [303]:
# Change the format of each column
math_scores_by_grade["Ninth Grade"] = math_scores_by_grade["Ninth Grade"].map("{:.1f}%".format)
math_scores_by_grade["Tenth Grade"] = math_scores_by_grade["Tenth Grade"].map("{:.1f}%".format)
math_scores_by_grade["Eleventh Grade"] = math_scores_by_grade["Eleventh Grade"].map("{:.1f}%".format)
math_scores_by_grade["Twelfth Grade"] = math_scores_by_grade["Twelfth Grade"].map("{:.1f}%".format)

In [304]:
# Remove the Index Name
math_scores_by_grade.index.name = None

#Display the frame
math_scores_by_grade.head()

                     Ninth Grade Tenth Grade Eleventh Grade Twelfth Grade
Bailey High School         77.1%       77.0%          77.5%         76.5%
Cabrera High School        83.1%       83.2%          82.8%         83.3%
Figueroa High School       76.4%       76.5%          76.9%         77.2%
Ford High School           77.4%       77.7%          76.9%         76.2%
Griffin High School        82.0%       84.2%          83.8%         83.4%